Revit 2027 API
ParameterTypeId.RbsFpSprinklerTemperatureRatingParam Property
 "Temperature Rating"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsFpSprinklerTemperatureRatingParam { get; }
Public Shared ReadOnly Property RbsFpSprinklerTemperatureRatingParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsFpSprinklerTemperatureRatingParam {
	ForgeTypeId^ get ();
}
static member RbsFpSprinklerTemperatureRatingParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace